Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2064DAH176.atdf
         <module id="02787" name="CFG" version="">
            <instance name="CFG">
               <register-group address-space="periph_pb1_std" name="CFG" name-in-module="CFG" offset="0x1f800000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00866" name="CMP" version="">
            <instance name="CMP">
               <register-group address-space="periph_pb3_std" name="CMP" name-in-module="CMP" offset="0x1f84c000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00000" name="CORE" version="">
            <instance name="CORE">
               <register-group address-space="" name="CORE" name-in-module="CORE" offset="0x0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02823" name="CRU" version="">
            <instance name="CRU">
               <register-group address-space="periph_pb1_std" name="CRU" name-in-module="CRU" offset="0x1f801200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00158" name="CRYPTO" version="">
            <instance name="CRYPTO">
               <register-group address-space="periph_indep" name="CRYPTO" name-in-module="CRYPTO" offset="0x1f8e5000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01461" name="CTMU" version="">
            <instance name="CTMU">
               <register-group address-space="periph_pb3_std" name="CTMU" name-in-module="CTMU" offset="0x1f84c200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00800" name="CVR" version="">
            <instance name="CVR">
               <register-group address-space="periph_pb1_std" name="CVR" name-in-module="CVR" offset="0x1f800e00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00184" name="DDR" version="">
            <instance name="DDR">
               <register-group address-space="periph_indep" name="DDR" name-in-module="DDR" offset="0x1f8e8000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00213" name="DDR_PHY" version="">
            <instance name="DDR_PHY">
               <register-group address-space="periph_indep" name="DDR_PHY" name-in-module="DDR_PHY" offset="0x1f8e9100" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01500" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph_pb1_fast" name="DMAC" name-in-module="DMAC" offset="0x1f811000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01520" name="DMT" version="">
            <instance name="DMT">
               <register-group address-space="periph_pb1_std" name="DMT" name-in-module="DMT" offset="0x1f800a00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01475" name="DSCTRL" version="">
            <instance name="DSCTRL">
               <register-group address-space="periph_pb6_std" name="DSCTRL" name-in-module="DSCTRL" offset="0x1f8c0200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00109" name="EBI" version="">
            <instance name="EBI">
               <register-group address-space="periph_indep" name="EBI" name-in-module="EBI" offset="0x1f8e1014" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01114" name="ETH" version="">
            <instance name="ETH">
               <register-group address-space="periph_pb5_std" name="ETH" name-in-module="ETH" offset="0x1f882000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00160" name="GLCD" version="">
            <instance name="GLCD">
               <register-group address-space="periph_indep" name="GLCD" name-in-module="GLCD" offset="0x1f8ea000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02467" name="GPIO" version="">
            <instance name="GPIO">
               <register-group address-space="periph_pb4_std" name="GPIO" name-in-module="GPIO" offset="0x1f860000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00183" name="GPU" version="">
            <instance name="GPU">
               <register-group address-space="periph_indep" name="GPU" name-in-module="GPU" offset="0x1f8eb000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02511" name="HLVD" version="">
            <instance name="HLVD">
               <register-group address-space="periph_pb1_std" name="HLVD" name-in-module="HLVD" offset="0x1f801800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
