Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2064DAH176.atdf
      <value-group caption="Increment Head/Tail bit" name="C2FIFOCON1__UINC">
         <value caption="1: (FIFO configured as a Transmit FIFO) When this bit is set, the FIFO head will increment by a single message" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive FIFO) When this bit is set, the FIFO tail will increment by a single message" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Reset bits" name="C2FIFOCON1__FRESET">
         <value caption="FIFO will be reset when bit is set, cleared by hardware when FIFO is reset. After setting, the user application should poll whether this bit is clear before taking any action" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Size bits(1)" name="C2FIFOCON1__FSIZE">
         <value caption="FIFO is 32 messages deep" name="" value="0x1f" />
         <value caption="FIFO is 3 messages deep" name="" value="0x2" />
         <value caption="FIFO is 2 messages deep" name="" value="0x1" />
         <value caption="FIFO is 1 message deep" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Not Empty Interrupt Flag bit(1)" name="C1FIFOINT1__RXNEMPTYIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x1" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is not empty, has at least 1 message, 0 = FIFO is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Half Full Interrupt Flag bit(1)" name="C1FIFOINT1__RXHALFIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is ? half full, 0 = FIFO is &lt; half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Full Interrupt Flag bit(1)" name="C1FIFOINT1__RXFULLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is full, 0 = FIFO is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Flag bit" name="C1FIFOINT1__RXOVFLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = Overflow event has occurred, 0 = No overflow event occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Flag bit(1)" name="C1FIFOINT1__TXEMPTYIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is empty, 0 = FIFO is not empty, at least 1 message queued to be transmitted" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" name="C1FIFOINT1__TXHALFIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is ? half full, 0 = FIFO is &gt; half full" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Flag bit(1)" name="C1FIFOINT1__TXNFULLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is not full, 0 = FIFO is full" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Empty Interrupt Enable bit" name="C1FIFOINT1__RXNEMPTYIE">
         <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Half Full Interrupt Enable bit" name="C1FIFOINT1__RXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Full Interrupt Enable bit" name="C1FIFOINT1__RXFULLIE">
         <value caption="Interrupt enabled for FIFO full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO full" name="" value="0x0" />
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C1FIFOINT1__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1" />
         <value caption="Interrupt disabled for overflow event" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C1FIFOINT1__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C1FIFOINT1__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C1FIFOINT1__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Not Empty Interrupt Flag bit(1)" name="C2FIFOINT1__RXNEMPTYIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x1" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is not empty, has at least 1 message, 0 = FIFO is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Half Full Interrupt Flag bit(1)" name="C2FIFOINT1__RXHALFIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is ? half full, 0 = FIFO is &lt; half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Full Interrupt Flag bit(1)" name="C2FIFOINT1__RXFULLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is full, 0 = FIFO is not full" name="" value="0x0" />
      </value-group>
