Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2064DAH176.atdf
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB6DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB7DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x  7)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB7DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB7DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Switching Slewing Active Status bit" name="SLEWCON__BUSY">
         <value caption="Clock frequency is being actively slewed to the new frequency" name="" value="0x1" />
         <value caption="Clock switch has reached its final value" name="" value="0x0" />
      </value-group>
      <value-group caption="Downward Slew Enable bit" name="SLEWCON__DNEN">
         <value caption="Slewing enabled for switching to a lower frequency" name="" value="0x1" />
         <value caption="Slewing disabled for switching to a lower frequency" name="" value="0x0" />
      </value-group>
      <value-group caption="Upward Slew Enable bit" name="SLEWCON__UPEN">
         <value caption="Slewing enabled for switching to a higher frequency" name="" value="0x1" />
         <value caption="Slewing disabled for switching to a higher frequency" name="" value="0x0" />
      </value-group>
      <value-group caption="Slew Divisor Steps Control bits" name="SLEWCON__SLWDIV">
         <value caption="Steps are divide by 128" name="" value="0x7" />
         <value caption="Steps are divide by 64" name="" value="0x6" />
         <value caption="Steps are divide by 32" name="" value="0x5" />
         <value caption="Steps are divide by 16" name="" value="0x4" />
         <value caption="Steps are divide by 8" name="" value="0x3" />
         <value caption="Steps are divide by 4" name="" value="0x2" />
         <value caption="Steps are divide by 2" name="" value="0x1" />
         <value caption="No divisor is used during slewing" name="" value="0x0" />
      </value-group>
      <value-group caption="System Clock Divide Control bits" name="SLEWCON__SYSDIV">
         <value caption="SYSCLK is divided by 16" name="" value="0xf" />
         <value caption="SYSCLK is divided by 15" name="" value="0xe" />
         <value caption="SYSCLK is divided by 3" name="" value="0x2" />
         <value caption="SYSCLK is divided by 2" name="" value="0x1" />
         <value caption="SYSCLK is not divided" name="" value="0x0" />
      </value-group>
      <value-group caption="Fast RC Oscillator Ready Status bit" name="CLKSTAT__FRCRDY">
         <value caption="FRC is stable and ready" name="" value="0x1" />
         <value caption="FRC is disabled for not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Ready Status bit" name="CLKSTAT__POSCRDY">
         <value caption="Posc is stable and ready" name="" value="0x1" />
         <value caption="Posc is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Ready Status bit" name="CLKSTAT__SOSCRDY">
         <value caption="Sosc is stable and ready" name="" value="0x1" />
         <value caption="Sosc is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Power RC Oscillator Ready Status bit" name="CLKSTAT__LPRCRDY">
         <value caption="LPRC is stable and ready" name="" value="0x1" />
         <value caption="LPRC is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Divided System PLL Ready Status bit" name="CLKSTAT__DIVSPLLRDY">
         <value caption="Divided System PLL is ready" name="" value="0x2" />
         <value caption="Divided System PLL is not ready" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00158" name="CRYPTO" version="1">
      <register-group name="CRYPTO">
         <register caption="Crypto Engine Revision" name="CEVER" offset="0x0" rw="R" size="4">
            <bitfield mask="0x0000FFFF" name="ID" />
            <bitfield mask="0x00FF0000" name="VERSION" />
            <bitfield mask="0xFF000000" name="REVISION" />
         </register>
         <register caption="Crypto Engine Control Register" name="CECON" offset="0x4" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="CECON__DMAEN" />
            <bitfield caption="Buffer Descriptor Processor Poll Enable bit" mask="0x00000002" name="BDPPLEN" values="CECON__BDPPLEN" />
            <bitfield caption="Buffer Descriptor Processor Fetch Enable bit" mask="0x00000004" name="BDPCHST" values="CECON__BDPCHST" />
            <bitfield caption="Input Data Swap Enable bit" mask="0x00000020" name="SWAPEN" values="CECON__SWAPEN" />
            <bitfield caption="Software Reset bit" mask="0x00000040" name="SWRST" values="CECON__SWRST" />
            <bitfield caption="Swap Output Data Enable bit" mask="0x00000080" name="SWAPOEN" values="CECON__SWAPOEN" />
         </register>
         <register caption="Crypto Engine Buffer Descriptor Register" name="CEBDADDR" offset="0x8" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BDPADDR" />
         </register>
         <register caption="Crypto Engine Buffer Descriptor Processor Register" name="CEBDPADDR" offset="0xc" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BASEADDR" />
         </register>
         <register caption="Crypto Engine Status Register" name="CESTAT" offset="0x10" rw="R" size="4">
            <bitfield mask="0x0000FFFF" name="BDCTRL" />
            <bitfield caption="Buffer Descriptor Processor Status bit" mask="0x00010000" name="ACTIVE" values="CESTAT__ACTIVE" />
            <bitfield caption="DMA Start Status bit" mask="0x00020000" name="START" values="CESTAT__START" />
            <bitfield caption="Buffer Descriptor Processor State Status bits" mask="0x003C0000" name="BDSTATE" values="CESTAT__BDSTATE" />
            <bitfield caption="Internal Error Phase of DMA Status bits" mask="0x03000000" name="ERRPHASE" values="CESTAT__ERRPHASE" />
            <bitfield caption="Internal Error Operation Status bits" mask="0x1C000000" name="ERROP" values="CESTAT__ERROP" />
            <bitfield caption="Internal Error Mode Status bits" mask="0xE0000000" name="ERRMODE" values="CESTAT__ERRMODE" />
         </register>
