Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2064DAH176.atdf
      <value-group caption="Flush FIFO Control bit" name="USBIENCSR1__FLUSH">
         <value caption="Flush the next packet to be read from the endpoint RX FIFO. The FIFO pointer is reset and the RXPKTRDY bit is cleared. This should only be used when RXPKTRDY is set. If the FIFO is double-buffered" name="" value="0x1" />
         <value caption="Normal FIFO operation" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL Handshake Control bit" name="USBIENCSR1__REQPKT">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL Handshake Status bit" name="USBIENCSR1__RXSTALL">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Clear Data Toggle Control bit" name="USBIENCSR1__CLRDT">
         <value caption="Reset the endpoint data toggle to 0" name="" value="0x1" />
         <value caption="Leave endpoint data toggle alone" name="" value="0x0" />
      </value-group>
      <value-group caption="Incomplete Packet Status bit" name="USBIENCSR1__INCOMPRX">
         <value caption="The packet in the RX FIFO during a high-bandwidth Isochronous/Interrupt transfer is incomplete because parts of the data were not received" name="" value="0x1" />
         <value caption="Written by then software to clear this bit" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Toggle Write Enable Control bit (" name="USBIENCSR1__DATATWEN">
         <value caption="DATATGGL can be written" name="" value="0x1" />
         <value caption="DATATGGL is not writable" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Request Mode Selection bit" name="USBIENCSR1__DMAREQMD">
         <value caption="DMA Request Mode 1" name="" value="0x1" />
         <value caption="DMA Request Mode 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable NYET Handshakes Control/PID Error Status bit" name="USBIENCSR1__PIDERR">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Request Enable Control bit" name="USBIENCSR1__DMAREQEN">
         <value caption="Enable DMA requests for the RX endpoint." name="" value="0x1" />
         <value caption="Disable DMA requests for the RX endpoint." name="" value="0x0" />
      </value-group>
      <value-group caption="Isochronous Endpoint Control bit" name="USBIENCSR1__AUTORQ">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0" />
      </value-group>
      <value-group caption="RXPKTRDY Automatic Clear Control bit" name="USBIENCSR1__AUTOCLR">
         <value caption="RXPKTRDY will be automatically cleared when a packet of RXMAXP bytes has been unloaded from the RX FIFO. When packets of less than the maximum packet size are unloaded" name="" value="0x1" />
         <value caption="No automatic clearing of RXPKTRDY" name="" value="0x0" />
      </value-group>
      <value-group caption="Operating Speed Control bits" name="USBIE0CSR2__SPEED">
         <value caption="Low-Speed" name="" value="0x3" />
         <value caption="Full-Speed" name="" value="0x2" />
         <value caption="Hi-Speed" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint Protocol Control bits" name="USBIENCSR2__PROTOCOL">
         <value caption="Interrupt" name="" value="0x3" />
         <value caption="Bulk" name="" value="0x2" />
         <value caption="Isochronous" name="" value="0x1" />
         <value caption="Control" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Endpoint Operating Speed Control bits (" name="USBIENCSR2__SPEED">
         <value caption="Low-Speed" name="" value="0x3" />
         <value caption="Full-Speed" name="" value="0x2" />
         <value caption="Hi-Speed" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Soft Connect/Disconnect Option bit" name="USBIE0CSR3__SOFTCONE">
         <value caption="Soft Connect/Disconnect is supported" name="" value="0x1" />
         <value caption="Soft Connect/Disconnect is not supported" name="" value="0x0" />
      </value-group>
      <value-group caption="Dynamic FIFO Sizing Option bit" name="USBIE0CSR3__DYNFIFOS">
         <value caption="Dynamic FIFO sizing is supported" name="" value="0x1" />
         <value caption="No Dynamic FIFO sizing" name="" value="0x0" />
      </value-group>
      <value-group caption="High-bandwidth TX ISO Option bit" name="USBIE0CSR3__HBTXEN">
         <value caption="High-bandwidth TX ISO endpoint support is selected" name="" value="0x1" />
         <value caption="No High-bandwidth TX ISO support" name="" value="0x0" />
      </value-group>
      <value-group caption="High-bandwidth RX ISO Option bit" name="USBIE0CSR3__HBRXEN">
         <value caption="High-bandwidth RX ISO endpoint support is selected" name="" value="0x1" />
         <value caption="No High-bandwidth RX ISO support" name="" value="0x0" />
      </value-group>
      <value-group caption="Byte Ordering Option bit" name="USBIE0CSR3__BIGEND">
         <value caption="Big Endian ordering" name="" value="0x1" />
         <value caption="Little Endian ordering" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Splitting Option bit" name="USBIE0CSR3__MPTXEN">
         <value caption="Automatic splitting of bulk packets is done" name="" value="0x1" />
         <value caption="No automatic splitting" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Amalgamation Option bit" name="USBIE0CSR3__MPRXEN">
         <value caption="Automatic amalgamation of bulk packets is done" name="" value="0x1" />
         <value caption="No automatic amalgamation" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Endpoint Protocol Control bits" name="USBIENCSR3__PROTOCOL">
         <value caption="Interrupt" name="" value="0x3" />
         <value caption="Bulk" name="" value="0x2" />
         <value caption="Isochronous" name="" value="0x1" />
         <value caption="Control" name="" value="0x0" />
      </value-group>
